---
kind: property
id: P:Autodesk.Revit.DB.Infrastructure.Alignment.EndStation
source: html/cbfe6749-6c31-dcd3-e111-15fb2c04f042.htm
---
# Autodesk.Revit.DB.Infrastructure.Alignment.EndStation Property

Specifies the station at which the alignment's geometric definition ends, in Revit internal model units (standard Imperial feet).

## Syntax (C#)
```csharp
public double EndStation { get; }
```

## Remarks
This station may be outside the displayed range ( DisplayedStartStation , DisplayedEndStation ).